Tutorial/floating-object/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      motionProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh       dynamicMotionSolverFvMesh;

motionSolverLibs    ("libsixDoFRigidBodyMotion.so");

motionSolver        sixDoFRigidBodyMotion;

sixDoFRigidBodyMotionCoeffs
{
    patches         (floatingObject);
    innerDistance   0.05;
    outerDistance   0.35;
    
    centreOfMass    (0.0 0.0 -0.016);
    mass           3.148;
    momentOfInertia ( 0.015 0.015 0.021 );

    report          on;
    
    accelerationRelaxation 0.7;

    solver
    {
        type Newmark;
    }

    constraints
    {
        fixedAxis
        {
            sixDoFRigidBodyMotionConstraint axis;
            axis (0 1 0);
        }
    }
    restraints 
    {
	verticalSpring
	{
            sixDoFRigidBodyMotionRestraint  linearSpring;
            anchor                          (0.0 0.0 -0.5);
            refAttachmentPt                 (0.0 0.0 -0.082);
            stiffness                       150;
            damping                         0;
            restLength                      0.4;
            gravityVector                   (0 0 -9.81);
            thickness                       0.025;
        }
    }
}


// ************************************************************************* //
